;----------------------------------------------------------
;prg07_17.asm - программа демонстрации изменения текущего каталога функцией 3Bh.
;----------------------------------------------------------
masm
model small
.data
dname	db	"c:\windows",0
point_dname	dd	dname
.stack	256
.486
.code
main:
	mov	ax,@data	;адрес сегмента данных - в регистр ax
	mov	ds,ax	;ax в ds
;-----изменим текущий каталог на каталог c:\windows----------------
	lds	dx,point_dname	;формируем указатель на строку с именем нового каталога
	mov	ah,3bh	;номер функции DOS
	int	21h
	jc	exit	;переход в случае ошибки
	nop	;для тестирования
exit:
;выход из программы
	mov	ax,4c00h	;пересылка 4c00h в регистр ax
	int	21h	;вызов прерывания с номером 21h
end	main		;конец программы с точкой входа main
